app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts`
---
  def index
    @carts = Cart.all

DELETE FROM `carts` WHERE `carts`.`id` = 2
---
  def destroy
    @cart.destroy if @cart.id = session[:cart_id]

SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = 2 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])